In [2]:
import pandas as pd
import sqlite3

In [3]:
con = sqlite3.connect('db')

In [4]:
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

Write a solution to find employees who have the highest salary in each of the departments.
Return the result table in any order.
The result format is in the following example.

In [5]:
employee.to_sql('employee', con, index=False, if_exists='replace')
department.to_sql('department', con, index=False, if_exists='replace')

2

In [20]:
sql = '''
        select 
            Department,
            Employee,
            Salary
        from
            (
            select 
                e.id,
                e.name as Employee,
                salary as Salary,
                d.name as Department,
                dense_rank() over(partition by d.name order by salary desc)as rnk
            from employee e
            join department d on e.departmentId = d.id
            ) t1
        where rnk = 1
'''

In [21]:
pd.read_sql(sql, con)

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      Sales    Henry   80000